docs/functions.md
```mermaid
graph LR

subgraph Приложение
  SetVolume("Настроить громкость")
  GetControls("Узнать основные клавиши для перемещения и стрельбы")
  StartGame("Начать игру")
  MoveCharacter("Перемещать персонажа")
  Shoot("Стрелять")
  GetInfo("Получать информацию о состоянии персонажа и оружия")
  KillEnemies("Убивать врагов")
  BuyUpgrades("Покупать улучшения")
  LevelUp("Повышать уровень")
end

User["Пользователь"]
User --> SetVolume
User --> GetControls
User --> StartGame
User --> MoveCharacter
User --> Shoot
User --> GetInfo
User --> KillEnemies
User --> BuyUpgrades
User --> LevelUp

```
