docs/functions.md
```mermaid
graph TD
    start((start))
    shoot{"Пользователь стреляет"}
    checkAmmo{есть патроны?}
    decreaseAmmo{"Уменьшить количество патронов"}
    flyBullet{"пуля летит дальше"}
    hitEnemy{попадание во врага?}
    hitWall{попадание в стену?}
    damageEnemy{Нанести урон врагу}
    disappearBullet{Пуля исчезает}
    displayInfo{Отображение количества патронов и статуса оружия}
    noAmmo{"Патроны закончились"}
    stop(stop)
    
    start --> shoot --> checkAmmo
    checkAmmo -- да --> decreaseAmmo
    decreaseAmmo --> flyBullet
    flyBullet -- да --> hitEnemy
    hitEnemy -- да --> damageEnemy
    hitEnemy -- нет --> hitWall
    hitWall -- да --> disappearBullet --> displayInfo --> stop
    checkAmmo -- нет --> noAmmo --> displayInfo --> stop
```
