docs/functions.md
```mermaid
graph TB
	Start --> Открытие_меню
	Открытие_меню --> Ожидание
	Ожидание --> |true| Ожидание
	Ожидание --> |false| Загрузка_игрового_уровня
	Загрузка_игрового_уровня --> Персонаж_на_верхней_левой_клетке_лабиринта
	Персонаж_на_верхней_левой_клетке_лабиринта --> Отображение_лабиринта_с_врагами
	Отображение_лабиринта_с_врагами --> Отображение_информации_о_персонаже_и_оружии
	Отображение_информации_о_персонаже_и_оружии --> Stop
```
